In [1]:
import pandas as pd
import sqlalchemy as sa
import psycopg2 as ps

In [2]:
from sqlalchemy import create_engine

In [3]:
%load_ext sql

In [4]:
%sql postgresql://postgres:lingga28@localhost:2828/datacamp

In [5]:
conn = create_engine('postgresql://postgres:lingga28@localhost/datacamp')

# 1. SQL strengths
### Exercise
Which of the below scenarios describes a situation in which using SQL would be useful?

### Possible Answers:
- A.All data needed to answer the business question is presented in a spreadsheet, and no complicated relationships exist between different data points.
- B. Large amounts of data about many different but related areas of a business are housed in a relational database.
- C. The data needed to answer the business question doesn't exist yet.

Answer: B

# 2. Developing SQL style
### Exercise
Recall from the video that it's important to pay attention to the formatting of SQL queries in order to make them readable. This is especially helpful as you learn more keywords and your queries get longer.

In this exercise, you'll review the below query about the patrons table. This code will run properly, but it is messy and hard to read. Your task is to determine which edits are appropriate to improve the query so that it follows best practices for SQL style.

SELECT CARD_NUM, TOTAL_FINE 
from patrons

Here's a reminder about what the patrons table looks like!
![](4.patrons_table.png)

### Instruction
Drag each suggestion to the proper zone depending on whether or not it will improve the query's style.

### Questions
Drag the items into the correct bucket:
- Make `SELECT` lowercase
- Add a `;` at the end of the query
- Make `CARD NUM` and `TOTAL_FINE` lowercase
- Capitalize `patrons`
- Capitalize `from`
- All code should be on just one line

### Answers:
Make suggestion:
- Add a `;` at the end of the query
- Make `CARD NUM` and `TOTAL_FINE` lowercase
- Capitalize `from`

Don't make suggestion;
- Capitalize `patrons`
- All code should be on just one line
- Make `SELECT` lowercase

# 3. Querying the books table
### Exercise
You're ready to practice writing your first SQL queries using the SELECT and FROM keywords. Recall from the video that SELECT is used to choose the fields that will be included in the result set, while FROM is used to pick the table in which the fields are listed.

Feel free to explore books in the exercise. Let's zoom in on this table in the database schema to see the fields and data types it contains.

Your task in this exercise is to practice selecting fields from books.

![](5.books_schema_zoom.png)

### task 1
### Instruction
Use SQL to return a result set of all book titles included in the books table.

In [22]:
%%sql --this is the way to write postgresql queries in jupyter notebook or lab

SELECT *
FROM books
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[(1, '10-Day Green Smoothie Cleanse', 'JJ Smith', 2016, 'Non Fiction'),
 (2, '11/22/63: A Novel', 'Stephen King', 2011, 'Fiction'),
 (3, '12 Rules for Life: An Antidote to Chaos', 'Jordan B. Peterson', 2018, 'Non Fiction')]

### task 2
### Instruction
Select both the title and author fields from books.

In [19]:
%%sql

-- Select title and author from the books table
SELECT title, author
FROM books
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('10-Day Green Smoothie Cleanse', 'JJ Smith'),
 ('11/22/63: A Novel', 'Stephen King'),
 ('12 Rules for Life: An Antidote to Chaos', 'Jordan B. Peterson')]

### task 3
### Instruction
Select all fields from the books table

In [21]:
%%sql

-- Select all fields from the books table
SELECT *
FROM books
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[(1, '10-Day Green Smoothie Cleanse', 'JJ Smith', 2016, 'Non Fiction'),
 (2, '11/22/63: A Novel', 'Stephen King', 2011, 'Fiction'),
 (3, '12 Rules for Life: An Antidote to Chaos', 'Jordan B. Peterson', 2018, 'Non Fiction')]

# 4. Making queries DISTINCT
### Exercises
You've learned that the DISTINCT keyword can be used to return unique values in a field. In this exercise, you'll use this understanding to find out more about the books table!

There are 350 books in the books table, representing all of the books that our local library has available for checkout. But how many different authors are represented in these 350 books? The answer is surely less than 350. For example, J.K. Rowling wrote all seven Harry Potter books, so if our library has all Harry Potter books, seven books will be written by J.K Rowling. There are likely many more repeat authors!

### task 1
### Instruction
Write SQL code that returns a result set with just one column listing the unique authors in the books table.

In [23]:
%%sql

SELECT DISTINCT author
FROM books
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('John Heilemann',), ('Sheryl Sandberg',), ('Brené Brown',)]

### task 2
### Exercises
Update the code to return the unique author and genre combinations in the books table.

In [24]:
%%sql

-- Select unique authors and genre combinations from the books table
SELECT DISTINCT author, genre
FROM books
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('Eben Alexander', 'Non Fiction'),
 ('Adam Mansbach', 'Fiction'),
 ('Garth Stein', 'Fiction')]

# 5. Aliasing
### Exercises
While the default column names in a SQL result set come from the fields they are created from, you've learned that aliasing can be used to rename these result set columns. This can be helpful for clarifying the intent or contents of the column.

Your task in this exercise is to incorporate an alias into one of the SQL queries that you worked with in the previous exercise!

### Instruction
Add an alias to the SQL query to rename the author column to unique_author in the result set.

In [25]:
%%sql

-- Alias author so that it becomes unique_author
SELECT DISTINCT author as unique_author
FROM books
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('John Heilemann',), ('Sheryl Sandberg',), ('Brené Brown',)]

# 5. VIEWing your query
### Exercises
You've worked hard to create the below SQL query:

SELECT DISTINCT author AS unique_author

FROM books;

What if you'd like to be able to refer to it later, or allow others to access and use the results? The best way to do this is by creating a view. Recall that a view is a virtual table: it's very similar to a real table, but rather than the data itself being stored, the query code is stored for later use.

### task 1
### Instructions
Add a single line of code that saves the results of the written query as a view called library_authors.

In [27]:
%%sql

-- Save the results of this query as a view called library_authors
CREATE VIEW library_authors AS
SELECT DISTINCT author AS unique_author
FROM books
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
(psycopg2.errors.DuplicateTable) relation "library_authors" already exists

[SQL: -- Save the results of this query as a view called library_authors
CREATE VIEW library_authors AS
SELECT DISTINCT author AS unique_author
FROM books
LIMIT 3; --just an addition, so that the table is not elongated]
(Background on this error at: https://sqlalche.me/e/14/f405)

### task 2
### Exercises
Check that the view was created by selecting all columns from library_authors.

In [28]:
%%sql

-- Your code to create the view:
CREATE VIEW library_authors AS
SELECT DISTINCT author AS unique_author
FROM books;

-- Select all columns from library_authors
SELECT *
FROM library_authors;

 * postgresql://postgres:***@localhost:2828/datacamp
(psycopg2.errors.DuplicateTable) relation "library_authors" already exists

[SQL: -- Your code to create the view:
CREATE VIEW library_authors AS
SELECT DISTINCT author AS unique_author
FROM books;]
(Background on this error at: https://sqlalche.me/e/14/f405)

# 6. Comparing flavors
### Exercises
The video introduced several differences between SQL Server and PostgreSQL. These are just two of many relational database systems available, but the differences are fairly representative of the types of differences you'll see between other SQL database systems and flavors as well.

### Instruction
Drag the statement to the database management system that it correctly describes.

### Question:
Drag the items into the correct bucket:
- Developed at the University of California, Barkeley
- Free and open source
- Research funds provided by DARPA
- Queried using T-SQL
- Created by Microsoft
- Has both free and enterprise version

### Answer
Postgresql:
- Developed at the University of California, Barkeley
- Free and open source
- Research funds provided by DARPA

SQL Server:
- Queried using T-SQL
- Created by Microsoft
- Has both free and enterprise version

# 7. Limiting results
### Exercises
Let's take a look at a few of the genres represented in our library's books.

Recall that limiting results is useful when testing code since result sets can have thousands of results! Queries are often written with a LIMIT of just a few records to test out code before selecting thousands of results from the database.

Let's practice with LIMIT!

### Instruction
Using PostgreSQL, select the genre field from the books table; limit the number of results to 10.

In [29]:
%%sql

-- Select the first 10 genres from books using PostgreSQL
Select genre
from books
LIMIT 10;

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[('Non Fiction',),
 ('Fiction',),
 ('Non Fiction',),
 ('Fiction',),
 ('Non Fiction',),
 ('Fiction',),
 ('Fiction',),
 ('Fiction',),
 ('Non Fiction',),
 ('Fiction',)]

# 8. Translating between flavors
### Exercises
In the previous exercise, you wrote the following code using PostgreSQL:

SELECT genre

FROM books

LIMIT 10;

The database in this course is a PostgreSQL database, so you won't be able to run SQL Server code in any of the exercises. What if you did want to update the above query to work with SQL Server, though? How would you do that?

### Possible Answers
- A. Replace FROM with TABLE
- B. Replace SELECT, FROM, and LIMIT with the corresponding SQL Server keywords
- C. Replace LIMIT with TOP
- D. Replace LIMIT with TOP and remove the ; at the end of the query

Answer: C